### Practice 0720

#### Grouping Rows by Time

In [1]:
import pandas as pd
import numpy as np
# Create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

In [2]:
df=pd.DataFrame(index=time_index)

In [3]:
df['Sale Amount'] = np.random.randint(1, 10, 100000)

In [4]:
# group rows by week, aggregate by sum (resample)
df.resample('W').sum()

            Sale Amount
2017-06-11        86324
2017-06-18       100747
2017-06-25       100348
2017-07-02       100473
2017-07-09       100822
2017-07-16        10434

In [5]:
df.head(3)

                     Sale Amount
2017-06-06 00:00:00            6
2017-06-06 00:00:30            8
2017-06-06 00:01:00            4

In [6]:
df.resample('2W').mean()

            Sale Amount
2017-06-11     4.995602
2017-06-25     4.987475
2017-07-09     4.992436
2017-07-23     5.016346

In [7]:
df.resample('M').count()

            Sale Amount
2017-06-30        72000
2017-07-31        28000

In [8]:
# default resample returns the 'right' edge of the range, can change
# this with the 'label' parameter:
df.resample('M', label='left').count()

            Sale Amount
2017-05-31        72000
2017-06-30        28000

#### Looping Over a Column

In [9]:
# return to titanic db
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

df = pd.read_csv(url)

# print first two names uppercased

for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [10]:
# for loops
# print first two names uppercased
for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [11]:
# list comprehensions
def uppercase(x):
    return x.upper()

In [12]:
# apply function
df['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [14]:
df.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851